Bwooce/tinygs_nRF52/src/main.cpp
    return dns_result;
}

/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static uint32_t mqtt_connected_uptime_ms = 0;
static uint32_t mqtt_last_pingresp_ms = 0;

static void mqtt_evt_handler(struct mqtt_client *client, const struct mqtt_evt *evt)
{
    uint32_t now = k_uptime_get_32();

    switch (evt->type) {
    case MQTT_EVT_CONNACK:
        if (evt->result == 0) {
            mqtt_connected_uptime_ms = now;
            LOG_INF("MQTT CONNECTED to %s:%d", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

            /* Derive MAC from device's IEEE address */
            {
                static char mac_str[13];
                uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                                  ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
                snprintf(mac_str, sizeof(mac_str), "%04X%08X",
                         (uint16_t)(dev_id >> 32), (uint32_t)dev_id);

                /* Subscribe to TinyGS topics */
                tinygs_subscribe(client, MQTT_USERNAME, MQTT_CLIENT_ID);

                /* Send welcome message — announces us to the TinyGS server */
                tinygs_send_welcome(client, MQTT_USERNAME, MQTT_CLIENT_ID,
                                    mac_str);
            }

            app_state = STATE_MQTT_CONNECTED;
        } else {
            LOG_ERR("MQTT CONNACK error: %d", evt->result);
            app_state = STATE_ERROR;
        }
        break;

    case MQTT_EVT_DISCONNECT:
        LOG_WRN("MQTT DISCONNECTED after %us: result=%d",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000,
                evt->result);
        app_state = STATE_ERROR;
        break;

    case MQTT_EVT_PINGRESP:
        mqtt_last_pingresp_ms = now;
        LOG_INF("MQTT PINGRESP (connected %us)",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;

    case MQTT_EVT_PUBLISH: {
        const struct mqtt_publish_param *pub = &evt->param.publish;
        static char rx_topic[128];
        static uint8_t rx_payload[768];
        uint32_t topic_len = MIN(pub->message.topic.topic.size, sizeof(rx_topic) - 1);
        memcpy(rx_topic, pub->message.topic.topic.utf8, topic_len);
        rx_topic[topic_len] = '\0';

        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        if (ret < 200) {
            LOG_INF("  payload: %s", (char *)rx_payload);
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            /* TODO: dispatch commands — for now just log them */
            if (strcmp(cmnd, "batch_conf") == 0 ||
                strcmp(cmnd, "begine") == 0) {
                LOG_INF("  → Radio config command received (not yet applied)");
            } else if (strcmp(cmnd, "status") == 0) {
                LOG_INF("  → Status request received");
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server log: %s", (char *)rx_payload);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* MQTT-TLS Connection                                                         */
/* -------------------------------------------------------------------------- */

/*
 * TLS socket test — connect directly to mqtt.tinygs.com via public NAT64.
 * Google NAT64 prefix: 64:ff9b::/96
 * mqtt.tinygs.com = 159.195.74.23 → 64:ff9b::9fc3:4a17
 */
static int test_tls_nat64(void)
{
    struct sockaddr_in6 dest;
    memset(&dest, 0, sizeof(dest));
    dest.sin6_family = AF_INET6;
    dest.sin6_port = htons(8883);

    /* 64:ff9b::9fc3:4a17 (mqtt.tinygs.com via Google NAT64) */
    otIp6Address nat64;
    memset(&nat64, 0, sizeof(nat64));
    nat64.mFields.m16[0] = htons(0x0064);
    nat64.mFields.m16[1] = htons(0xff9b);
    /* m16[2..5] = 0 */
    nat64.mFields.m8[12] = 159;
    nat64.mFields.m8[13] = 195;
    nat64.mFields.m8[14] = 74;
    nat64.mFields.m8[15] = 23;
    memcpy(&dest.sin6_addr, &nat64, 16);

    char addr_str[INET6_ADDRSTRLEN];
    net_addr_ntop(AF_INET6, &dest.sin6_addr, addr_str, sizeof(addr_str));

    /* Test 1: Plain TCP to public NAT64 address */
    LOG_INF("NAT64 test: TCP to [%s]:8883 ...", addr_str);
    int sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TCP);
    if (sock >= 0) {
        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TCP SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TCP connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    }

    /* Test 2: TLS socket to same address */
    LOG_INF("NAT64 test: TLS to [%s]:8883 ...", addr_str);
    sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TLS_1_2);
    if (sock >= 0) {
        int peer_verify = TLS_PEER_VERIFY_NONE;
        zsock_setsockopt(sock, SOL_TLS, TLS_PEER_VERIFY,
                          &peer_verify, sizeof(peer_verify));

        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TLS SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TLS connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    } else {
        LOG_ERR("NAT64 TLS socket() failed: errno=%d", errno);
    }

